# ***********************************************************************************************
# Title     : アイテムベースのk近傍法
# Objective : TODO
# Created by: Owner
# Created on: 2021/01/31
# URL       : https://cran.r-project.org/web/packages/rrecsys/vignettes/b2_IBCF.html
# ***********************************************************************************************


# ＜ポイント＞
# 0 準備
# 1 データ加工
# 2 評価用データ作成
# 3 グローバル平均
# 4 アイテム平均
# 5 ユーザー平均


# 0 準備 ------------------------------------------------------------------------------

library(tidyverse)
library(rrecsys)
library(Hmisc)

# データロード
# --- MovieLensのデータセット
data("ml100k")


# 1 データ加工 ----------------------------------------------------------------------

# データ定義
d <- ml100k %>% defineData()

# データ構造
d %>% str()

# データ確認
d@data %>% dim()


# 2 評価用データ作成 ---------------------------------------------------------------

# 評価用データ作成
eval <- d %>% evalModel(folds = 2)

# データ構造
eval %>% str()
eval %>% list.tree()


# 3 グローバル平均 --------------------------------------------------------------------

# 予測タスクを評価
# --- アイテムベースのk近傍法
# --- コサイン類似度
ib_model_res <- eval %>% evalPred("ibknn", simFunct = "cos", neigh = 10)

# 確認
ib_model_res %>% print()


# 4 アイテム平均 ---------------------------------------------------------------------

# 予測タスクを評価
# --- アイテム平均
itemAv <- eval %>% evalPred("itemAver")

# 確認
itemAv %>% print()


# 5 ユーザー平均 ---------------------------------------------------------------------

# 予測タスクを評価
# --- ユーザー平均
userAv <- eval %>% evalPred("useraverage")

# 確認
userAv %>% print()
